In [2]:
import pandas as pd

In [3]:
data=pd.read_excel('Book1.xlsx')

In [4]:
data.head()

   any   Unnamed: 1
0  1780    14.07500
1  1781    14.71667
2  1782    13.63333
3  1783    14.40000
4  1784    13.61667

In [5]:
data.rename(columns={'Unnamed: 1':'values'},inplace=True)

In [6]:
data.set_index('any ',inplace=True)

In [7]:
data.head()

        values
any
1780  14.07500
1781  14.71667
1782  13.63333
1783  14.40000
1784  13.61667

# 1) Moving average method -
## it is subdivied into three method -
### i) Simple Moving Average (SMA):- The SMA is the unweighted mean of the previous M or N points. The selection of sliding window data points, depending on the amount of smoothing is preferred since increasing the value of M or N, improves the smoothing at the expense of accuracy.

In [9]:
data["SMA"]=data['values'].rolling(3,min_periods=1).mean() # 3 represent window of three value

In [11]:
data.head()

        values        SMA
any
1780  14.07500  14.075000
1781  14.71667  14.395835
1782  13.63333  14.141667
1783  14.40000  14.250000
1784  13.61667  13.883333

### ii) Cumulative moving avarage-The CMA is the unweighted mean of past values, till the current time.

In [16]:
data['CMA']=data['values'].expanding().mean()

In [17]:
data.head()

        values        SMA        CMA
any
1780  14.07500  14.075000  14.075000
1781  14.71667  14.395835  14.395835
1782  13.63333  14.141667  14.141667
1783  14.40000  14.250000  14.206250
1784  13.61667  13.883333  14.088334

### iii) Exponential Moving Average (EMA)- EMA is mainly used to identify trends and to filter out noice.The weights of the elements is decreased gradually over time.These means it gives weights to recent data points, not hsitorical ones. compared with SMA,theEMA is faster to change and more sensitive.

In [18]:
data['EMA_alpha_0.1']=data['values'].ewm(alpha=0.1).mean()
data['EMA_alpha_0.3']=data['values'].ewm(alpha=0.3).mean()

In [19]:
data.head()

        values        SMA        CMA  EMA_alpha_0.1  EMA_alpha_0.3
any
1780  14.07500  14.075000  14.075000      14.075000      14.075000
1781  14.71667  14.395835  14.395835      14.412721      14.452453
1782  13.63333  14.141667  14.141667      14.125123      14.078424
1783  14.40000  14.250000  14.206250      14.205052      14.205379
1784  13.61667  13.883333  14.088334      14.061373      13.993086